Tekla Open API Reference for Tekla Structures 2025
Localization Constructor (String, String)
 Creates a new localization instance.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Localization(
	string fileName,
	string language
)
Public Sub New (
	fileName As String,
	language As String
)
Parameters
fileName
Type: System.String
The file from which the localization strings are loaded.
language
Type: System.String
The set localization language.
See Also
Reference
Localization Class
Localization Overload
Tekla.Structures.Dialog Namespace